app/controllers/photos_api_controller.rb

SELECT "photos".* FROM "photos"
INSERT INTO "photos" ("created_at", "name", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def index
		@photos = Photo.all

    array = []
    @photos.each do |photo|
    	photo_push = {
    		id: photo.id,
    		name: photo.name,
    		photo: photo.photo.url
    	}

    	array << photo_push

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 4]]
---
	def destroy
		@photo = Photo.find(params[:id])
		@photo.destroy