app/controllers/photos_controller.rb

INSERT INTO "photos" ("created_at", "name", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy